_posts/2012-02-25-saas-class.html
---
layout: post
title: Personal notes for coursera's SaaS class
tags: software,design, lecture notes
---

<p>
I am following coursera's <a href="https://www.coursera.org/saas/class/index">saas-class</a>  online, and using this post for
keeping track of progress/notes/links etc. These notes are very rough,
mostly a personal log of progress&hellip;
</p>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Lecture notes </h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1">Engineering Software is Different from Engineering Hardware (02/25) </h3>
<div class="outline-text-3" id="text-1-1">


</div>

<div id="outline-container-1-1-1" class="outline-4">
<h4 id="sec-1-1-1">Legacy code: old SW meet customer's needs, but difficult to evolve due to design elegance </h4>
<div class="outline-text-4" id="text-1-1-1">

</div>

</div>

<div id="outline-container-1-1-2" class="outline-4">
<h4 id="sec-1-1-2">Waterfall vs Agile </h4>
<div class="outline-text-4" id="text-1-1-2">

<ul>
<li>Requirements analysis and specification
</li>
<li>Architectural design
</li>
<li>Implementation
</li>
<li>Verfication
</li>
<li>Operations and Maintenance
</li>
<li>Works well for important software with specs
</li>
<li>Plan to throw one away - you are going to anyway ;)
</li>
<li>If a problem has no solution, it may not be a problem, but a
      fact, not to be solved, but to be coped with over time.(Peres's Law)
</li>
<li>Individuals and interactions over processes &amp; tools
</li>
<li>Working software over comprehensive documentation
</li>
<li>Customer collaboration over contract negotiation
</li>
<li>Responding to change over following a plan
</li>
<li>Embrace change as a fact of life
</li>
</ul>

</div>

</div>

<div id="outline-container-1-1-3" class="outline-4">
<h4 id="sec-1-1-3">Assurance </h4>
<div class="outline-text-4" id="text-1-1-3">

<ul>
<li>Verification - Did you build the thing <b>right</b>
</li>
<li>Validation - Did you build the <b>right</b> thing
</li>
<li>Testing - Exhaustive testing infeasible
</li>
<li>Use Automation, Coverage, Regression testing, Integration
      testing, Test Driven Design
</li>
</ul>

</div>

</div>

<div id="outline-container-1-1-4" class="outline-4">
<h4 id="sec-1-1-4">Productivity </h4>
<div class="outline-text-4" id="text-1-1-4">

<ul>
<li>Clarity via conciseness
<ul>
<li>Syntax: short and easier to read
</li>
<li>Raise the level of abstraction
</li>
</ul>

</li>
<li>Synthesis
<ul>
<li>Automatic code generation
</li>
</ul>

</li>
<li>Reuse
<ul>
<li>Procedures and functions
</li>
<li>Standardized Libraries
</li>
<li>OOP
</li>
<li>Design Patterns
</li>
</ul>

</li>
<li>Automation and tools
<ul>
<li>Replace tedious manual tasks with automation to save time,
        improve accuracy
</li>
<li>Concerns (Dependability/ UI)
</li>
<li>IMPORTANT SKILL - LEARN NEW TOOLS ALL THE TIME
</li>
</ul>

</li>
</ul>

</div>

</div>

<div id="outline-container-1-1-5" class="outline-4">
<h4 id="sec-1-1-5">Sotware as a service </h4>
<div class="outline-text-4" id="text-1-1-5">

<ul>
<li>SaaS delivers SW &amp; data as a service
</li>
<li>No install worries
</li>
<li>No data loss
</li>
<li>Easy for groups to interact with same data
</li>
<li>No compatibility hassles for developers
</li>
<li>1 copy - easier upgrades/features
</li>
</ul>

</div>

</div>

<div id="outline-container-1-1-6" class="outline-4">
<h4 id="sec-1-1-6">SOA </h4>
<div class="outline-text-4" id="text-1-1-6">

<ul>
<li>SW architecture where all components are designed to be services
</li>
<li>Apps composed of interoperable services
</li>
<li><a href="http://news.ycombinator.com/item?id=3101876">Steve Yeggi - SOA rant</a>
</li>
</ul>

</div>

</div>

<div id="outline-container-1-1-7" class="outline-4">
<h4 id="sec-1-1-7">Cloud computing, fallacies, pitfalls </h4>
<div class="outline-text-4" id="text-1-1-7">

<ul>
<li>Communication 
</li>
<li>Scalability
</li>
<li>Dependability
</li>
<li>Cluster - commodity hardware
</li>
<li>Utility Computing / Public Cloud Computing
</li>
<li>AWS - 42nd fastest computer in the world @ $700/hr!
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2">SaaS Architecture </h3>
<div class="outline-text-3" id="text-1-2">


</div>

<div id="outline-container-1-2-1" class="outline-4">
<h4 id="sec-1-2-1">Web as a Client-Server System; TCP/IP Intro </h4>
<div class="outline-text-4" id="text-1-2-1">

<ul>
<li>Internet: request/reply oriented
</li>
<li>Client/Server v-s Peer-to-Peer(bittorrent) architecture
</li>
<li>Localhost - 127.0.0.1
</li>
<li>IP - no-gaurantee, best-effort service
</li>
<li>TCP - makes IP reliable by detecting "dropped" packets
</li>
<li>TCP ports allow multiple TCP apps on same computer
</li>
<li>DNS - maps names to IP addresses
</li>
<li>HTTP - ASCII based request/reply protocol
</li>
<li>Protocol versions &amp; status code; Response Header and Response Body
</li>
<li>nc -l &lt;portnumber&gt;
</li>
<li>HTTP is stateless! Cookies to the rescue
</li>
<li>Per-user state: customization/ click tracking etc.
</li>
</ul>

</div>

</div>

<div id="outline-container-1-2-2" class="outline-4">
<h4 id="sec-1-2-2">3-tiered Shared-Nothing Architecture and Scaling </h4>
<div class="outline-text-4" id="text-1-2-2">

<ul>
<li>map URI to correct function
</li>
<li>pass arguments etc.
</li>
<li>invoke program on server/storage etc.
</li>
<li>Presentation layer/ App Layer/ Database layer
</li>
<li>Developer environment vs medium-scale deployment vs
      large-scale deployment
</li>
<li>Sharding v/s Replicate data
</li>
</ul>

</div>

</div>

<div id="outline-container-1-2-3" class="outline-4">
<h4 id="sec-1-2-3">Model-View-Controller Architecture </h4>
<div class="outline-text-4" id="text-1-2-3">

<ul>
<li>separate organization of data (Model) with presentation(UI)
      using a controller
</li>
<li>View 'indirectly' interacts with Model
</li>
<li>Each entity has a model, controller &amp; set of views
</li>
<li>Establishing connections between different views?
</li>
<li>Models often talk to each other!
</li>
<li>Alternatives
<ul>
<li>Page Controller  &lt;Each view has a controller&gt;
</li>
<li>Front Controller &lt;One Controller&gt;
</li>
<li>Template View (PHP) &lt;No controller - embeded PHP&gt;
</li>
</ul>

</li>
</ul>

</div>

</div>

<div id="outline-container-1-2-4" class="outline-4">
<h4 id="sec-1-2-4">Models, Databases and ActiveRecord </h4>
<div class="outline-text-4" id="text-1-2-4">

<ul>
<li>How to represent persisted object in storage
</li>
<li>In-Memory vs In-Storage?
</li>
<li>CRUD -&gt; serialize / deserealize
</li>
<li>ActiveRecord : every model knows how to CRUD itself
</li>
<li>Rails Models store data in RDBMS
</li>
<li>Each model in its own table, each row is an instance of the model
</li>
<li>Alternative: DataMapper -&gt; each model defines its own
      CRUD. Google App Engine. No RDMS -&gt; easier to scale?. Difficult
      to map relationships without models
</li>
</ul>

</div>

</div>

<div id="outline-container-1-2-5" class="outline-4">
<h4 id="sec-1-2-5">Controllers, Routes and RESTfulness </h4>
<div class="outline-text-4" id="text-1-2-5">

<ul>
<li>Route maps &lt;HTTP request, URI&gt; to controlloer action
</li>
<li>Rails routing:
<ul>
<li>Map URI -&gt; method
</li>
<li>Easily create &lt;URI&gt; calls
</li>
<li>Parse parameters passed to URI
</li>
<li>CRUD routes
</li>
<li>REST (Representation State Transfer)
</li>
<li>Each URI has all the information it needs to render its view
</li>
</ul>

</li>
</ul>

</div>

</div>

<div id="outline-container-1-2-6" class="outline-4">
<h4 id="sec-1-2-6">Templates, Views and HAML </h4>
<div class="outline-text-4" id="text-1-2-6">

<ul>
<li>Views -&gt; markup with interpolation
</li>
<li>Template View Pattern: HAML + closure
</li>
<li>Alternate: Transform View pattern
</li>
<li>You can put code in view, but you shouldn't. HAML makes it
      intentionally awkward.
</li>
</ul>

</div>
</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Web Links </h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><a href="http://beta.saasbook.info/">http://beta.saasbook.info/</a> </h3>
<div class="outline-text-3" id="text-2-1">

</div>
</div>
</div>
